warewolf/platform_bk7231t/bk7231t_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_ble_em_cs.h
__INLINE void ble_isolastsn_setf(int elt_idx, uint8_t isolastsn)
{
    ASSERT_ERR((((uint16_t)isolastsn << 0) & ~((uint16_t)0x00000001)) == 0);
    EM_BLE_WR(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (EM_BLE_RD(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE) & ~((uint16_t)0x00000001)) | ((uint16_t)isolastsn << 0));
}

/**
 * @brief BTCNTSYNC0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00           BTCNTSYNC0   0x0
 * </pre>
 */
#define BLE_BTCNTSYNC0_ADDR   (0x00814050 + EM_BLE_CS_OFFSET)
#define BLE_BTCNTSYNC0_INDEX  0x00000028
#define BLE_BTCNTSYNC0_RESET  0x00000000

__INLINE uint16_t ble_btcntsync0_get(int elt_idx)
{
    return EM_BLE_RD(BLE_BTCNTSYNC0_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_btcntsync0_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_BTCNTSYNC0_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_BTCNTSYNC0_MASK   ((uint16_t)0x0000FFFF)
#define BLE_BTCNTSYNC0_LSB    0
#define BLE_BTCNTSYNC0_WIDTH  ((uint16_t)0x00000010)

#define BLE_BTCNTSYNC0_RST    0x0

__INLINE uint16_t ble_btcntsync0_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_BTCNTSYNC0_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    ASSERT_ERR((localVal & ~((uint16_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_btcntsync0_setf(int elt_idx, uint16_t btcntsync0)
{
    ASSERT_ERR((((uint16_t)btcntsync0 << 0) & ~((uint16_t)0x0000FFFF)) == 0);
    EM_BLE_WR(BLE_BTCNTSYNC0_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)btcntsync0 << 0);
}

/**
 * @brief BTCNTSYNC1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:00           BTCNTSYNC1   0x0
 * </pre>
 */
#define BLE_BTCNTSYNC1_ADDR   (0x00814052 + EM_BLE_CS_OFFSET)
#define BLE_BTCNTSYNC1_INDEX  0x00000029
#define BLE_BTCNTSYNC1_RESET  0x00000000

__INLINE uint16_t ble_btcntsync1_get(int elt_idx)
{
    return EM_BLE_RD(BLE_BTCNTSYNC1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_btcntsync1_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_BTCNTSYNC1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_BTCNTSYNC1_MASK   ((uint16_t)0x000007FF)
#define BLE_BTCNTSYNC1_LSB    0
#define BLE_BTCNTSYNC1_WIDTH  ((uint16_t)0x0000000B)

#define BLE_BTCNTSYNC1_RST    0x0

__INLINE uint16_t ble_btcntsync1_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_BTCNTSYNC1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    ASSERT_ERR((localVal & ~((uint16_t)0x000007FF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_btcntsync1_setf(int elt_idx, uint16_t btcntsync1)
{
    ASSERT_ERR((((uint16_t)btcntsync1 << 0) & ~((uint16_t)0x000007FF)) == 0);
    EM_BLE_WR(BLE_BTCNTSYNC1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)btcntsync1 << 0);
}

/**
 * @brief FCNTSYNC register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15              EVTRXOK   0
 *  09:00           FCNTRXSYNC   0x0
 * </pre>
 */
#define BLE_FCNTSYNC_ADDR   (0x00814054 + EM_BLE_CS_OFFSET)
#define BLE_FCNTSYNC_INDEX  0x0000002A
#define BLE_FCNTSYNC_RESET  0x00000000

__INLINE uint16_t ble_fcntsync_get(int elt_idx)
{
    return EM_BLE_RD(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_fcntsync_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_EVTRXOK_BIT       ((uint16_t)0x00008000)
#define BLE_EVTRXOK_POS       15
#define BLE_FCNTRXSYNC_MASK   ((uint16_t)0x000003FF)
#define BLE_FCNTRXSYNC_LSB    0
#define BLE_FCNTRXSYNC_WIDTH  ((uint16_t)0x0000000A)

#define BLE_EVTRXOK_RST       0x0
#define BLE_FCNTRXSYNC_RST    0x0

__INLINE void ble_fcntsync_unpack(int elt_idx, uint8_t* evtrxok, uint16_t* fcntrxsync)
{
    uint16_t localVal = EM_BLE_RD(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);

    *evtrxok = (localVal & ((uint16_t)0x00008000)) >> 15;
    *fcntrxsync = (localVal & ((uint16_t)0x000003FF)) >> 0;
}

__INLINE uint8_t ble_evtrxok_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    return ((localVal & ((uint16_t)0x00008000)) >> 15);
}

__INLINE uint16_t ble_fcntrxsync_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    return ((localVal & ((uint16_t)0x000003FF)) >> 0);
}

__INLINE void ble_fcntrxsync_setf(int elt_idx, uint16_t fcntrxsync)
{
    ASSERT_ERR((((uint16_t)fcntrxsync << 0) & ~((uint16_t)0x000003FF)) == 0);
    EM_BLE_WR(BLE_FCNTSYNC_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)fcntrxsync << 0);
}

/**
 * @brief TXRXDESCCNT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08         ACLRXDESCCNT   0x0
 *  07:00         ACLTXDESCCNT   0x0
 * </pre>
 */
#define BLE_TXRXDESCCNT_ADDR   (0x00814056 + EM_BLE_CS_OFFSET)
#define BLE_TXRXDESCCNT_INDEX  0x0000002B
#define BLE_TXRXDESCCNT_RESET  0x00000000

__INLINE uint16_t ble_txrxdesccnt_get(int elt_idx)
{
    return EM_BLE_RD(BLE_TXRXDESCCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_txrxdesccnt_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_TXRXDESCCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_ACLRXDESCCNT_MASK   ((uint16_t)0x0000FF00)
#define BLE_ACLRXDESCCNT_LSB    8
#define BLE_ACLRXDESCCNT_WIDTH  ((uint16_t)0x00000008)
#define BLE_ACLTXDESCCNT_MASK   ((uint16_t)0x000000FF)
#define BLE_ACLTXDESCCNT_LSB    0
#define BLE_ACLTXDESCCNT_WIDTH  ((uint16_t)0x00000008)

#define BLE_ACLRXDESCCNT_RST    0x0
#define BLE_ACLTXDESCCNT_RST    0x0

__INLINE void ble_txrxdesccnt_pack(int elt_idx, uint8_t aclrxdesccnt, uint8_t acltxdesccnt)
{
    ASSERT_ERR((((uint16_t)aclrxdesccnt << 8) & ~((uint16_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint16_t)acltxdesccnt << 0) & ~((uint16_t)0x000000FF)) == 0);
    EM_BLE_WR(BLE_TXRXDESCCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE,  ((uint16_t)aclrxdesccnt << 8) | ((uint16_t)acltxdesccnt << 0));
}

__INLINE void ble_txrxdesccnt_unpack(int elt_idx, uint8_t* aclrxdesccnt, uint8_t* acltxdesccnt)
{
    uint16_t localVal = EM_BLE_RD(BLE_TXRXDESCCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);

